; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p12---int100n150-m25---int100c110---s245---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level36 level1 level37)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level37 level1 level38)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level38 level1 level39)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level39 level1 level40)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level40 level1 level41)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level41 level1 level42)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level42 level1 level43)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level43 level1 level44)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level44 level1 level45)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level45 level1 level46)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level46 level1 level47)
(sum level46 level11 level57)
(sum level46 level13 level59)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level47 level1 level48)
(sum level47 level11 level58)
(sum level47 level13 level60)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level48 level1 level49)
(sum level48 level11 level59)
(sum level48 level13 level61)
(sum level48 level20 level68)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level49 level1 level50)
(sum level49 level11 level60)
(sum level49 level13 level62)
(sum level49 level20 level69)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level50 level1 level51)
(sum level50 level11 level61)
(sum level50 level13 level63)
(sum level50 level20 level70)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level51 level1 level52)
(sum level51 level11 level62)
(sum level51 level13 level64)
(sum level51 level20 level71)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level52 level1 level53)
(sum level52 level11 level63)
(sum level52 level13 level65)
(sum level52 level20 level72)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level53 level1 level54)
(sum level53 level11 level64)
(sum level53 level13 level66)
(sum level53 level20 level73)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level54 level1 level55)
(sum level54 level11 level65)
(sum level54 level13 level67)
(sum level54 level20 level74)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level55 level1 level56)
(sum level55 level11 level66)
(sum level55 level13 level68)
(sum level55 level20 level75)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level56 level1 level57)
(sum level56 level11 level67)
(sum level56 level13 level69)
(sum level56 level20 level76)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level57 level1 level58)
(sum level57 level11 level68)
(sum level57 level13 level70)
(sum level57 level20 level77)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level58 level1 level59)
(sum level58 level11 level69)
(sum level58 level13 level71)
(sum level58 level20 level78)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level59 level1 level60)
(sum level59 level11 level70)
(sum level59 level13 level72)
(sum level59 level20 level79)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level60 level1 level61)
(sum level60 level11 level71)
(sum level60 level13 level73)
(sum level60 level20 level80)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level61 level1 level62)
(sum level61 level11 level72)
(sum level61 level13 level74)
(sum level61 level20 level81)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level62 level1 level63)
(sum level62 level11 level73)
(sum level62 level13 level75)
(sum level62 level20 level82)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level63 level1 level64)
(sum level63 level11 level74)
(sum level63 level13 level76)
(sum level63 level20 level83)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level64 level1 level65)
(sum level64 level11 level75)
(sum level64 level13 level77)
(sum level64 level20 level84)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level65 level1 level66)
(sum level65 level11 level76)
(sum level65 level13 level78)
(sum level65 level20 level85)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level66 level1 level67)
(sum level66 level11 level77)
(sum level66 level13 level79)
(sum level66 level20 level86)
(sum level66 level23 level89)
(sum level66 level24 level90)
(sum level67 level1 level68)
(sum level67 level11 level78)
(sum level67 level13 level80)
(sum level67 level20 level87)
(sum level67 level23 level90)
(sum level67 level24 level91)
(sum level68 level1 level69)
(sum level68 level11 level79)
(sum level68 level13 level81)
(sum level68 level20 level88)
(sum level68 level23 level91)
(sum level68 level24 level92)
(sum level69 level1 level70)
(sum level69 level11 level80)
(sum level69 level13 level82)
(sum level69 level20 level89)
(sum level69 level23 level92)
(sum level69 level24 level93)
(sum level70 level1 level71)
(sum level70 level11 level81)
(sum level70 level13 level83)
(sum level70 level20 level90)
(sum level70 level23 level93)
(sum level70 level24 level94)
(sum level71 level1 level72)
(sum level71 level11 level82)
(sum level71 level13 level84)
(sum level71 level20 level91)
(sum level71 level23 level94)
(sum level72 level1 level73)
(sum level72 level11 level83)
(sum level72 level13 level85)
(sum level72 level20 level92)
(sum level73 level1 level74)
(sum level73 level11 level84)
(sum level73 level13 level86)
(sum level73 level20 level93)
(sum level74 level1 level75)
(sum level74 level11 level85)
(sum level74 level13 level87)
(sum level74 level20 level94)
(sum level75 level1 level76)
(sum level75 level11 level86)
(sum level75 level13 level88)
(sum level76 level1 level77)
(sum level76 level11 level87)
(sum level76 level13 level89)
(sum level77 level1 level78)
(sum level77 level11 level88)
(sum level77 level13 level90)
(sum level78 level1 level79)
(sum level78 level11 level89)
(sum level78 level13 level91)
(sum level79 level1 level80)
(sum level79 level11 level90)
(sum level79 level13 level92)
(sum level80 level1 level81)
(sum level80 level11 level91)
(sum level80 level13 level93)
(sum level81 level1 level82)
(sum level81 level11 level92)
(sum level81 level13 level94)
(sum level82 level1 level83)
(sum level82 level11 level93)
(sum level83 level1 level84)
(sum level83 level11 level94)
(sum level84 level1 level85)
(sum level85 level1 level86)
(sum level86 level1 level87)
(sum level87 level1 level88)
(sum level88 level1 level89)
(sum level89 level1 level90)
(sum level90 level1 level91)
(sum level91 level1 level92)
(sum level92 level1 level93)
(sum level93 level1 level94)

(connected l0 l3)
(fuelcost level1 l0 l3)
(connected l0 l4)
(fuelcost level13 l0 l4)
(connected l1 l2)
(fuelcost level20 l1 l2)
(connected l1 l4)
(fuelcost level23 l1 l4)
(connected l2 l1)
(fuelcost level20 l2 l1)
(connected l2 l3)
(fuelcost level11 l2 l3)
(connected l2 l4)
(fuelcost level24 l2 l4)
(connected l3 l0)
(fuelcost level1 l3 l0)
(connected l3 l2)
(fuelcost level11 l3 l2)
(connected l3 l4)
(fuelcost level11 l3 l4)
(connected l4 l0)
(fuelcost level13 l4 l0)
(connected l4 l1)
(fuelcost level23 l4 l1)
(connected l4 l2)
(fuelcost level24 l4 l2)
(connected l4 l3)
(fuelcost level11 l4 l3)

(at t0 l1)
(fuel t0 level94)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l4)
(at p6 l0)
(at p7 l3)
(at p8 l4)
(at p9 l2)
(at p10 l4)
(at p11 l3)
)

(:goal
(and
(at p0 l4)
(at p1 l0)
(at p2 l0)
(at p3 l4)
(at p4 l0)
(at p5 l1)
(at p6 l1)
(at p7 l0)
(at p8 l1)
(at p9 l0)
(at p10 l2)
(at p11 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 12
2. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 12
3. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 12
4. (drive t0 l1 l2 level74 level20 level94)
   deleted: (at t0 l1) (fuel t0 level94)
   added: (at t0 l2) (fuel t0 level74)
   goals met: 0 of 12
5. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 12
6. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 12
7. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 12
8. (drive t0 l2 l3 level63 level11 level74)
   deleted: (at t0 l2) (fuel t0 level74)
   added: (at t0 l3) (fuel t0 level63)
   goals met: 0 of 12
9. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 12
10. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 12
11. (drive t0 l3 l0 level62 level1 level63)
   deleted: (at t0 l3) (fuel t0 level63)
   added: (at t0 l0) (fuel t0 level62)
   goals met: 0 of 12
12. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 12
13. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 12
14. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 2 of 12
15. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 3 of 12
16. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 4 of 12
17. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 5 of 12
18. (drive t0 l0 l4 level49 level13 level62)
   deleted: (at t0 l0) (fuel t0 level62)
   added: (at t0 l4) (fuel t0 level49)
   goals met: 5 of 12
19. (load p10 t0 l4)
   deleted: (at p10 l4)
   added: (in p10 t0)
   goals met: 5 of 12
20. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 5 of 12
21. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 5 of 12
22. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 6 of 12
23. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 7 of 12
24. (drive t0 l4 l1 level26 level23 level49)
   deleted: (at t0 l4) (fuel t0 level49)
   added: (at t0 l1) (fuel t0 level26)
   goals met: 7 of 12
25. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 8 of 12
26. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 9 of 12
27. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 10 of 12
28. (drive t0 l1 l2 level6 level20 level26)
   deleted: (at t0 l1) (fuel t0 level26)
   added: (at t0 l2) (fuel t0 level6)
   goals met: 10 of 12
29. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 11 of 12
30. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 12 of 12
